Revit 2026 API

# ExternalCommandsDataClassName Property

---

The name of the class containing the implementation for the command.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ClassName { get; set; }
```
```vb
Public Property ClassName As String
	Get
	Set
```
```cpp
public:
property String^ ClassName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ClassName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The class name which implements the interface IExternalCommand.

#### Reference

ExternalCommandsData Class

Autodesk.Revit.UI Namespace